'''
思路：
    遍历翻译字符，存放到列表中，对列表进行去重，然后取数
'''
def f(words):
    a={'a':".-",'b': "-...", 'c':"-.-.", 'd':"-..", 'e':".",'f': "..-.",'g': "--.", 'h':"....",
       'i':"..", 'j':".---",'k': "-.-",'l': ".-..",'m': "--",'n': "-.",'o': "---",'p': ".--.",
    'q': "--.-",'r' :".-.", 's':"...",'t' :"-", 'u':"..-",'v': "...-",'w': ".--",'x': "-..-",
       'y':"-.--", 'z':"--.."}
    l=[]
    for i in words:
        s = ''
        for j in i:
            s+=a[j]
        l.append(s)
    l=set(l)
    count=0
    for i in l:
        count+=1
    return count

words = ["gin", "zen", "gig", "msg"]
print(f(words))
